# Creating a Data Frame

In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame()

In [3]:
df['name'] = ['himanshu','gargi']

In [4]:
df['age'] = [20,20]
df['course'] = ['BSc','BCOM']

In [5]:
df

       name  age course
0  himanshu   20    BSc
1     gargi   20   BCOM

## Alternatively, once we have created a DataFrame object, we can append new rows to the bottom:

In [6]:
new_df = pd.Series(['yamini',21,'BSc'],index=['name','age','course'])

### point to remember is that always use S capital in Series

In [7]:
df.append(new_df,ignore_index = True)

       name  age course
0  himanshu   20    BSc
1     gargi   20   BCOM
2    yamini   21    BSc

In [8]:
df #this is a dataframe

       name  age course
0  himanshu   20    BSc
1     gargi   20   BCOM

In [9]:
new_df #this is a series

name      yamini
age           21
course       BSc
dtype: object